app/controllers/results_controller.rb

  def show
    #@trip = Trip.find(params[:id])

    costs = Trip.find(params[:id])
---
SELECT "trips".* FROM "trips" WHERE "trips"."id" = ? LIMIT 1  [["id", "1"]]


    #puts costs.aacostpts

    cards = Creditcard.all
---
SELECT "creditcards".* FROM "creditcards"

    #end

    costs = Trip.find(params[:id])
    rates = Rate.all
---
SELECT "rates".* FROM "rates"